==================
Macro definitions
==================

GLOBAL &Macroname

LOCAL &GLOBAL

PRIVATE &msg1 &(started) &{line_counT}

---

(script
  (macro_declaration
    (identifier))
  (macro_declaration
    (identifier))
  (macro_declaration
    (identifier)
    (identifier)
    (identifier)))

==================
Recursive macro expansion
==================

&&cmd

---

(script
  (recursive_macro_expansion
    (identifier)))

==================
Number literals
==================

&a = 0y100010001

&b = 1000
&b = 123445.

&c = 0x12af
&c = 0xA12F

&d = 1.2
&d = 1.3e+34
&d = 0.123

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
Bitmask literals
==================

&a = 0y10xx10
&a = 0yX111XXX

&b = 0xFX
&b = 0xff1cxxxx

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
Time literals
==================

&a = 10s
&a = 10.s
&a = 23.24ms
&a = 123us
&a = 75.0ns

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
String literals
==================

&a = "name"
&a = "abc""def"

&b = "line continuation \
character"
&b = \
"line continuation character"

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
Character literals
==================

&a = 'a'
&a = 'z'
&a = 'A'
&a = 'Z'
&a = '0'
&a = '9'

&b = '\
9'
&b = \
'0'

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
Symbol literals
==================

&a = `main`
&b = _exit

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (identifier)))

==================
Address literals
==================

&a = P:0x1af
&a = P:1234
&a = P:1234.

&b = UD:0x1000
&b = NSP:1:::50.::0x0000:0xffff000008080004

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
PRACTICE functions
==================

&a = Register(PC)
&a = FOUND()
&a = OS.ENV(HOME)
&a = Data.Word.BigEndean(MX:0x1234)

---

(script
  (assignment_expression
    left: (identifier)
    right: (practice_function
      function: (identifier)
      arguments: (argument_list
        (identifier))))
  (assignment_expression
    left: (identifier)
    right: (practice_function
      function: (identifier)
      arguments: (argument_list)))
  (assignment_expression
    left: (identifier)
    right: (practice_function
      function: (identifier)
      arguments: (argument_list
        (identifier))))
  (assignment_expression
    left: (identifier)
    right: (practice_function
      function: (identifier)
      arguments: (argument_list
        (literal)))))

==================
Assignment expression
==================

&a = 1
&b=&(macro)

&c=~&a+100.

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (identifier))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (unary_expression
        argument: (identifier))
      right: (literal))))

==================
Binary operators
==================

&a=1&&2
&a = 1^^&b
&a= &b||2
&a= 1ms+2.ns
&a= 1-&b
&a= &b*2
&a= 1/2
&a= 1%&b
&a= &b|2
&a= 1^2
&a= 1&&b
&a= &b==2
&a= 1!=2
&a= 1>&b
&a= &b>=2
&a= 1<=2
&a= 2<1
&a= 1<<&b
&a= &b>>2

---

(script
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal))))

==================
Unary operators
==================

&a= !1
&a=+&b
&a= -5.7
&a= ~1.ms

---

(script
  (assignment_expression
    left: (identifier)
    right: (unary_expression
      argument: (literal)))
  (assignment_expression
    left: (identifier)
    right: (unary_expression
      argument: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (unary_expression
      argument: (literal)))
  (assignment_expression
    left: (identifier)
    right: (unary_expression
      argument: (literal))))

==================
Range operator
==================

&a= 0x1000..0x1fff
&a=0x1000--0x1fff
&a=(-1000.)--{-50.}
&a='a'--'f'
&a='A'..'F'
&a=teststart--testend
&a=`main`..`_exit`

---

(script
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (unary_expression
        argument: (literal))
      right: (unary_expression
        argument: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal))))

==================
Operator precedence
==================

&a = 1<<!2*3
&a = 1>>~2/3

&b = 1+!2*3
&b = 1-~2%3

&c = 1+!2!=3
&c = 1-~2>=3

&d = 1&!2==3

&e = 1&+2^3

&f = 1|+2^3

&g = 1&&-2^3

&h = 1^^+2&&3

&i = 1^^+2||3

---

(script
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal))))

==================
Expressions with parentheses
==================

&a = (1+FOUND())
&a = (-1+&(b))*3
&a = {(1)&&(-&b^3)}

---

(script
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (practice_function
        function: (identifier)
        arguments: (argument_list))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (identifier))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (identifier))
        right: (literal)))))
