==================
Macro definitions
==================

GLOBAL &Macroname

LOCAL &GLOBAL

PRIVATE &msg1 &(started) &{line_counT}

PARAMETERS &_myvalue1 &my_Value2

---

(script
  (command_expression
    command: (identifier)
    macro: (identifier))
  (command_expression
    command: (identifier)
    macro: (identifier))
  (command_expression
    command: (identifier)
    macro: (identifier)
    macro: (identifier)
    macro: (identifier))
  (command_expression
    command: (identifier)
    macro: (identifier)
    macro: (identifier)))

==================
Recursive macro expansion
==================

&&cmd

---

(script
  (recursive_macro_expansion
    (identifier)))

==================
Internal C-style variable definitions
==================

Var.NEWLOCAL int \i
Var.NEWGLOBAL char[10][128] \myStr

---

(script
  (command_expression
    command: (identifier)
    (literal)
    variable: (identifier))
  (command_expression
    command: (identifier)
    (literal)
    variable: (identifier)))

==================
Number literals
==================

&a = 0y100010001

&b = 1000
&b = 123445.

&c = 0x12af
&c = 0xA12F

&d = 1.2
&d = 1.3e+34
&d = 0.123

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
Bitmask literals
==================

&a = 0y10xx10
&a = 0yX111XXX

&b = 0xFX
&b = 0xff1cxxxx

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
Time literals
==================

&a = 10s
&a = 10.s
&a = 23.24ms
&a = 123us
&a = 75.0ns

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
String literals
==================

&a = "name"
&a = "abc""def"
&a = "\"

&b = "line continuation \
character"
&b = \
"line continuation character"

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
Character literals
==================

&a = 'a'
&a = 'z'
&a = 'A'
&a = 'Z'
&a = '0'
&a = '9'
&a = '\'
&a = '''

&b = '\
9'
&b = \
'0'

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
Symbol literals
==================

&a = _exit
&a = SIEVE

&b = \MCC\sieve
&b = \\app\MCC\sieve
&b = \\\1\\linux\do_mounts\load_ramdisk
&b = \\\Dom0\\linux\do_mounts\load_ramdisk

&c = \\linux\\load_ramdisk
&c = \\\Dom0\\\\load_ramdisk

&c = `main`
&c = `nestxf1::~nestxf1`
&c = \`ops::operator<<=`

List \\sieve\sieve\fill_buffer+0x64
Var.set `class1::operator+(int)\i`

---

(script
  (assignment_expression
    left: (identifier)
    right: (identifier))
  (assignment_expression
    left: (identifier)
    right: (identifier))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (binary_expression
        left: (literal)
        right: (literal))))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal))))

==================
Address literals
==================

&a = P:0x1af
&a = P:1234
&a = P:1234.

&b = UD:0x1000
&b = NSP:1:::50.::0x0000:0xffff000008080004

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (literal)))

==================
Path literals
==================

DO TEST.CMM
DO .\test.cmm
DO ..\test.cmm
DO A:\FOLDER\TEST.CMM
DO objs\abc.abs

CD.DO objs/abs.abs
CD.DO ./src/abc.def
CD.DO ../src/abc.def
CD.DO ~/proj/src/main.c

PEDIT ~~\a\b\c
PEDIT ~~~\a\b.cmm
PEDIT ~~~~\demo\analyzer\perf.ts

OPEN #4 ~~/a/b/c
OPEN #4 ~~~/a/b.cmm
OPEN #4 ~~~~/demo/analyzer/perf.ts

PSTEP ~~/demo/arm/compiler/arm/arm9.cmm
Data.LOAD *.abs
DO \practice\*
ChDir.DO \practice\*
EDIT a?.c
DIR *.obj

---

(script
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal))))

==================
PRACTICE functions
==================

&a = Register(PC)
&a = FOUND()
&a = OS.ENV(HOME)
&a = Data.Word.BigEndean(MX:0x1234)
&a=STRing.Replace(OS.PWD(),"/",0.)

---

(script
  (assignment_expression
    left: (identifier)
    right: (practice_function
      function: (identifier)
      arguments: (argument_list
        (identifier))))
  (assignment_expression
    left: (identifier)
    right: (practice_function
      function: (identifier)
      arguments: (argument_list)))
  (assignment_expression
    left: (identifier)
    right: (practice_function
      function: (identifier)
      arguments: (argument_list
        (identifier))))
  (assignment_expression
    left: (identifier)
    right: (practice_function
      function: (identifier)
      arguments: (argument_list
        (literal))))
  (assignment_expression
    left: (identifier)
    right: (practice_function
      function: (identifier)
      arguments: (argument_list
        (practice_function
          function: (identifier)
          arguments: (argument_list))
        (literal)
        (literal)))))

==================
Commands
==================

::B::WinPrint.Data.dump  0x1000 /Byte
Data.DRAWFFT ,%Decimal.Byte,VM:0++0x4f ,, 2.0 512., ,
PEDIT *
OPEN #1,"~~/license.t32" /Read
CD.DO /home
do a/b/c

---

(script
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)
      (identifier)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (identifier)
      (binary_expression
        left: (literal)
        right: (literal))
      (literal)
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)
      (literal)
      (identifier)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (identifier)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (binary_expression
        left: (binary_expression
          left: (identifier)
          right: (identifier))
        right: (identifier)))))

==================
Commands with embedded blocks
==================

DIALOG.view
(&+
       POS 1. 1. 10.
text:  TEXT "A Basic Dialog"
)

DIALOG.view
(&-
MYNAME: POS 22. 0. 24. 1.
        DEFEDIT "" ""
)

---

(script
  (command_expression
    command: (identifier))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)
      (literal)
      (literal)))
  (labeled_command
    label: (identifier)
    (command_expression
      command: (identifier)
      arguments: (argument_list
        (literal))))
  (command_expression
    command: (identifier))
  (labeled_command
    label: (identifier)
    (command_expression
      command: (identifier)
      arguments: (argument_list
        (literal)
        (literal)
        (literal)
        (literal))))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (literal)
      (literal))))

==================
Commands with internal C-style variables
==================

Var.Set \i=0x42
Var.Set \myStr[5]="hello"
ECHO %Hex Var.VALUE(\i)
ECHO Var.STRing(\myStr[5])
Var.View %all \i \myStr

---

(script
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (assignment_expression
        left: (identifier)
        right: (literal))))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (assignment_expression
        left: (identifier)
        right: (literal))))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (identifier)
      (practice_function
        function: (identifier)
        arguments: (argument_list
          (identifier)))))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (practice_function
        function: (identifier)
        arguments: (argument_list
          (identifier)))))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (identifier)
      (identifier)
      (identifier))))

==================
Command with C expression
==================

Var.view *(&flags+20)

---

(script
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (c_pointer_expression
        argument: (binary_expression
          left: (identifier)
          right: (literal))))))

==================
Assignment expression
==================

&a = 1
&b=&(macro)

&c=~&a+100.

---

(script
  (assignment_expression
    left: (identifier)
    right: (literal))
  (assignment_expression
    left: (identifier)
    right: (identifier))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (unary_expression
        argument: (identifier))
      right: (literal))))

==================
Binary operators
==================

&a=1&&2
&a = 1^^&b
&a= &b||2
&a= 1ms+2.ns
&a= 1-&b
&a= &b*2
&a= 1/2
&a= 1%&b
&a= &b|2
&a= 1^2
&a= 1&&b
&a= &b==2
&a= 1!=2
&a= 1>&b
&a= &b>=2
&a= 1<=2
&a= 2<1
&a= 1<<&b
&a= &b>>2

---

(script
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (literal))))

==================
Unary operators
==================

&a= !1
&a=+&b
&a= -5.7
&a= ~1.ms

---

(script
  (assignment_expression
    left: (identifier)
    right: (unary_expression
      argument: (literal)))
  (assignment_expression
    left: (identifier)
    right: (unary_expression
      argument: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (unary_expression
      argument: (literal)))
  (assignment_expression
    left: (identifier)
    right: (unary_expression
      argument: (literal))))

==================
Range operator
==================

&a= 0x1000..0x1fff
&a=0x1000--0x1fff
&a=(-1000.)--{-50.}
&a='a'--'f'
&a='A'..'F'
&a=teststart--testend
&a=`main`..`_exit`

---

(script
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (unary_expression
        argument: (literal))
      right: (unary_expression
        argument: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (identifier)
      right: (identifier)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (literal))))

==================
Operator precedence
==================

&a = 1<<!2*3
&a = 1>>~2/3

&b = 1+!2*3
&b = 1-~2%3

&c = 1+!2!=3
&c = 1-~2>=3

&d = 1&!2==3

&e = 1&+2^3

&f = 1|+2^3

&g = 1&&-2^3

&h = 1^^+2&&3

&i = 1^^+2||3

---

(script
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (literal))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (literal)
        right: (unary_expression
          argument: (literal)))
      right: (literal))))

==================
Expressions with parentheses
==================

&a = (1+FOUND())
&a = (-1+&(b))*3
&a = {(1)&&(-&b^3)}

---

(script
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (practice_function
        function: (identifier)
        arguments: (argument_list))))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (binary_expression
        left: (unary_expression
          argument: (literal))
        right: (identifier))
      right: (literal)))
  (assignment_expression
    left: (identifier)
    right: (binary_expression
      left: (literal)
      right: (binary_expression
        left: (unary_expression
          argument: (identifier))
        right: (literal)))))
